# PointLocationOnCurve Class

---
Defines the measurement parameters necessary to create a point at a specific location on a curve.
SystemObject Autodesk.Revit.DBPointLocationOnCurve
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class PointLocationOnCurve : IDisposable

    Public Class PointLocationOnCurve
    	Implements IDisposable

    public ref class PointLocationOnCurve : IDisposable

    type PointLocationOnCurve =
        class
            interface IDisposable
        end
The PointLocationOnCurve type exposes the following members.
| Name| Description
---|---|---
| PointLocationOnCurve|  Constructs a new instance of a class, with given or default values, to place a point on a curve.
Top
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| MeasureFrom|  The location on the curve from which the measurement is taken.
| MeasurementType|  The measurement type.
| MeasurementValue|  The measurement value.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the PointLocationOnCurve
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
The class will store the following and provides functions to deal with them:
  * The user visible Measurement Type (driving parameter type).
  * The corresponding measurement value (driving parameter).
  * MeasureFrom that tells from where the (driving parameter) measurement is calculated.

#### Reference
Autodesk.Revit.DB Namespace